In [1]:
!wget http://www2.informatik.uni-freiburg.de/~cziegler/BX/BX-CSV-Dump.zip

--2020-09-19 23:12:49--  http://www2.informatik.uni-freiburg.de/~cziegler/BX/BX-CSV-Dump.zip
Resolving www2.informatik.uni-freiburg.de (www2.informatik.uni-freiburg.de)... 132.230.105.133
Connecting to www2.informatik.uni-freiburg.de (www2.informatik.uni-freiburg.de)|132.230.105.133|:80... connected.
HTTP request sent, awaiting response... 200 OK
Length: 26085508 (25M) [application/zip]
Saving to: ‘BX-CSV-Dump.zip’

BX-CSV-Dump.zip     100%[===================>]  24.88M  2.63MB/s    in 9.4s

2020-09-19 23:12:59 (2.65 MB/s) - ‘BX-CSV-Dump.zip’ saved [26085508/26085508]

In [5]:
!ls

BX-Book-Ratings.csv  BX-CSV-Dump.zip  books-review-biases.ipynb
BX-Books.csv	     BX-Users.csv

In [1]:
!unzip BX-CSV-Dump.zip

Archive:  BX-CSV-Dump.zip
  inflating: BX-Book-Ratings.csv
  inflating: BX-Books.csv
  inflating: BX-Users.csv

In [4]:
!ls

BX-Book-Ratings.csv  BX-CSV-Dump.zip  Untitled.ipynb
BX-Books.csv	     BX-Users.csv

In [6]:
import pandas as pd

In [8]:
#Users
u_cols = ['user_id', 'location', 'age']
users = pd.read_csv('BX-Users.csv', sep=';', names=u_cols, encoding='latin-1',low_memory=False)

In [9]:
#Books
i_cols = ['isbn', 'book_title' ,'book_author','year_of_publication', 'publisher', 'img_s', 'img_m', 'img_l']
items = pd.read_csv('BX-Books.csv', sep=';', names=i_cols, encoding='latin-1',low_memory=False)

In [10]:
#Ratings
r_cols = ['user_id', 'isbn', 'rating']
ratings = pd.read_csv('BX-Book-Ratings.csv', sep=';', names=r_cols, encoding='latin-1',low_memory=False)

In [11]:
users.head(5)

   user_id                         location  age
0  User-ID                         Location  Age
1        1               nyc, new york, usa  NaN
2        2        stockton, california, usa   18
3        3  moscow, yukon territory, russia  NaN
4        4        porto, v.n.gaia, portugal   17

In [12]:
items.head(5)

,isbn,book_title,book_author,year_of_publication,publisher,img_s,img_m,img_l
0,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
1,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
2,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
3,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
4,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...

In [13]:
ratings.head(5)

   user_id        isbn       rating
0  User-ID        ISBN  Book-Rating
1   276725  034545104X            0
2   276726  0155061224            5
3   276727  0446520802            0
4   276729  052165615X            3

In [14]:
users = users.drop(users.index[0])
items = items.drop(items.index[0])
ratings = ratings.drop(ratings.index[0])

In [15]:
df = pd.merge(users, ratings, on='user_id')
df = pd.merge(df, items, on='isbn')
df.head(5)

,user_id,location,age,isbn,rating,book_title,book_author,year_of_publication,publisher,img_s,img_m,img_l
0,2,"stockton, california, usa",18,0195153448,0,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,8,"timmins, ontario, canada",NaN,0002005018,5,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,11400,"ottawa, ontario, canada",49,0002005018,0,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
3,11676,"n/a, n/a, n/a",NaN,0002005018,8,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
4,41385,"sudbury, ontario, canada",NaN,0002005018,0,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [16]:
df.shape

(1031175, 12)

In [17]:
df = df.dropna()

In [18]:
df.describe()

,user_id,location,age,isbn,rating,book_title,book_author,year_of_publication,publisher,img_s,img_m,img_l
count,753325,753325,753325,753325,753325,753325,753325,753325,753325,753325,753325,753325
unique,53888,16156,141,229011,11,205185,87251,124,14513,228792,228792,228792
top,198711,"toronto, ontario, canada",33,0971880107,0,Wild Animus,Stephen King,2002,Ballantine Books,http://images.amazon.com/images/P/0971880107.0...,http://images.amazon.com/images/P/0971880107.0...,http://images.amazon.com/images/P/0971880107.0...
freq,6456,12147,32864,2141,483699,2141,7664,65904,24707,2141,2141,2141

In [19]:
df.shape

(753325, 12)

In [20]:
df['age'] = df['age'].astype(int)
df['user_id'] = df['user_id'].astype(int)

In [21]:
location = df.location.str.split(', ', n=2, expand=True)
location.columns=['city', 'state', 'country']

df['city'] = location['city']
df['state'] = location['state']
df['country'] = location['country']

In [22]:
df.isna().sum()

user_id                    0
location                   0
age                        0
isbn                       0
rating                     0
book_title                 0
book_author                0
year_of_publication        0
publisher                  0
img_s                      0
img_m                      0
img_l                      0
city                       0
state                      0
country                10635
dtype: int64

In [23]:
df.head(5)

,user_id,location,age,isbn,rating,book_title,book_author,year_of_publication,publisher,img_s,img_m,img_l,city,state,country
0,2,"stockton, california, usa",18,0195153448,0,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,stockton,california,usa
2,11400,"ottawa, ontario, canada",49,0002005018,0,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,ottawa,ontario,canada
5,67544,"toronto, ontario, canada",30,0002005018,8,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,toronto,ontario,canada
6,85526,"victoria, british columbia, canada",36,0002005018,0,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,victoria,british columbia,canada
7,96054,"ottawa, ontario, canada",29,0002005018,0,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,ottawa,ontario,canada

In [24]:
df_usa=df.loc[df['country'] == 'usa']
df_canada=df.loc[df['country'] == 'canada']

In [25]:
df_usa.shape

(553265, 15)

In [26]:
df_canada.shape

(65408, 15)

In [38]:
df.groupby('country').count()

,user_id,location,age,isbn,rating,book_title,book_author,year_of_publication,publisher,img_s,img_m,img_l,city,state
country,,,,,,,,,,,,,,
",",43,43,43,43,43,43,43,43,43,43,43,43,43,43
"\""n/a\""""",2,2,2,2,2,2,2,2,2,2,2,2,2,2
"aberdeenshire, united kingdom",7,7,7,7,7,7,7,7,7,7,7,7,7,7
afghanistan,3,3,3,3,3,3,3,3,3,3,3,3,3,3
alachua,3,3,3,3,3,3,3,3,3,3,3,3,3,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
"yu-song, guam-dong, 626-1, 302, south korea",1,1,1,1,1,1,1,1,1,1,1,1,1,1
yugoslavia,5,5,5,5,5,5,5,5,5,5,5,5,5,5
zambia,1,1,1,1,1,1,1,1,1,1,1,1,1,1
zimbabwe,14,14,14,14,14,14,14,14,14,14,14,14,14,14
"álava, spain",1,1,1,1,1,1,1,1,1,1,1,1,1,1

In [35]:
grouped = df.groupby('country').sum().reset_index()
grouped.sort_values('country', ascending=False)

                                         country   user_id   age
304                                 álava, spain     23325    17
303                                     zimbabwe    469643   452
302                                       zambia     75812    55
301                                   yugoslavia    905785   112
300  yu-song, guam-dong, 626-1, 302, south korea    194260    23
..                                           ...       ...   ...
4                                        alachua    326568   180
3                                    afghanistan    426179   170
2                  aberdeenshire, united kingdom   1307327   350
1                                       \"n/a\""    510798   108
0                                              ,  10988535  1916

[305 rows x 3 columns]

In [32]:
df.shape

(753325, 15)

# Biases due to reviewer's country of origin

In [41]:
# Count number of records by category = country
df['country'].value_counts()

usa                          553265
canada                        65408
united kingdom                25804
germany                       19637
australia                     14024
                              ...
n/a, mexico                       1
macedonia                         1
middlesex, united kingdom         1
nsw, australia                    1
paraguay                          1
Name: country, Length: 305, dtype: int64

# Biases due to reviewer's Age Bracket

In [45]:
# Count number of records by category = age
df['age'].value_counts()

33     32864
29     30648
30     27202
32     26492
36     26097
       ...
157        1
133        1
118        1
123        1
147        1
Name: age, Length: 141, dtype: int64

In [57]:
bins = [18, 30, 40, 50, 60, 70, 120]
labels = ['18-29', '30-39', '40-49', '50-59', '60-69', '70+']

In [59]:
#df['agerange'] = pd.cut(age.age, bins, labels = labels)
df['age_bins']=pd.cut(x=df['age'], bins=bins, labels=labels)

In [60]:
df['age_bins']

0            NaN
2          40-49
5          18-29
6          30-39
7          18-29
           ...
1031170    30-39
1031171    30-39
1031172    30-39
1031173    30-39
1031174    30-39
Name: age_bins, Length: 753325, dtype: category
Categories (6, object): [18-29 < 30-39 < 40-49 < 50-59 < 60-69 < 70+]

In [61]:
df['age_bins'].unique()

[NaN, 40-49, 18-29, 30-39, 50-59, 70+, 60-69]
Categories (6, object): [18-29 < 30-39 < 40-49 < 50-59 < 60-69 < 70+]

In [62]:
df['age_bins'].value_counts()

30-39    232922
18-29    221236
40-49    146902
50-59     87351
60-69     27182
70+        5530
Name: age_bins, dtype: int64

### 31% of reviwers of age group 30 to 39 
### 29.5% of reviewers of age group 18 to 29
### 19.5% of reviwers of age group 40 to 49
### 11.5% of reviewers of age group 50 to 59
### 3.6% of reviewers of age group 60 to 69
### 0.73% of reviwers of age group 70+